{
    "title": {
        "welcome": "Jestem",
        "iam": "i zajmuję się",
        "job": "tworzeniem aplikacji webowych"
    },
    "nav": {
        "home": "Strona główna",
        "about": "O mnie",
        "projects": "Projekty"
    },
    "about": {
        "title": "O mnie",
        "text": "Ukończyłem VI Liceum Ogólnokształcące im. Jana Kochanowskiego w Radomiu. Jestem finalistą z wyróżnieniem XXVIII i finalistą XXIX Olimpiady Informatycznej. Pracowałem przez niecały rok dla firmy Bolid sp. z o. o. jako programista, gdzie tworzyłem sterownik dla urządzeń IoT w Pythonie i interfejs użytkownika w React'cie. Obecnie studiuję Informatykę na Uniwersytecie Warszawskim. Jestem zainteresowany tworzeniem aplikacji webowych, a także uczeniem się nowych technologii."
    },
    "projects": {
        "title": "Moje projekty",
        "tech": "Wykorzystane technologie",
        "mytriproutes": {
            "description": "Strona internetowa do zarządzania zdjęciami i trasami gps. Użytkownicy mogą wrzucić swoje pliki, które będą przechowywane na serwerze. Następnie strona przedstawia je na różne sposoby (prezentacja, interaktywna mapa, kolaż zdjęć i więcej).",
            "skills": "Tworzenie tej strony nauczyło mnie pisania łatwego do utrzymania kodu w dużym projekcie. Nauczyłem się tworzenia i używania API (w tym Stripe'a), a także zdobyłem więcej wiedzy i doświadczenia przy pracy z wyżej wymienionymi technologiami. Dowiedziałem się wiele na temat przesyłania i przetwarzania plików na backendzie, a także optymalizacji obrazów."
        },
        "nextGallery": {
            "description": "Pakiet npm do tworzenia galerii zdjęć z wykorzystaniem next.js. Ułożenie zdjęć jest ustalane za pomocą specjalnego algorytmu. Użytkownik może dostosować wielkość zdjęć do swoich potrzeb.",
            "skills": "Stworzyłem ten pakiet, ponieważ potrzebowałem sposobu na wyświetlenie galerii zdjęć na stronie mytriproutes.com. Chciałem wyodrębnić tą funkcjonalność do osobnej biblioteki i udostępnić ją dla innych jako OpenSource. Nauczyłem się jak skonfigurować package.json do bardziej zaawansowanego użytku oraz jak działają wersje i publikowanie pakietów npm."
        },
        "ltv": {
            "description": "Pokazuje zachowanie wektorów na płaszczyźnie przy przekształceniu liniowym zadanym macierzą 2x2. Oblicza również wartości własne i wektory własne.",
            "skills": "Stworzyłem ten projekt w trakcie zajęć z algebry liniowej na uniwersytecie. Nauczyłem się integracji biblioteki p5.js z React'em oraz jak postawić stronę na vercel'u."
        },
        "other": {
            "title": "Algorytmy sortujące i inne",
            "description": "Inne, mniejsze projekty graficzne zrobione w bibliotece p5.js.",
            "skills": ""
        }
    }
}